Revit 2027 API
BuiltInFailures.RevolutionFailures Class
 Failures about Revolution.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.RevolutionFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class RevolutionFailures
Public NotInheritable Class RevolutionFailures
public ref class RevolutionFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type RevolutionFailures = class end
The BuiltInFailures.RevolutionFailures type exposes the following members.
Properties
Name | Description
CannotDrawRevolution |  Can't create surface of revolution.
ProfileCrossesRevolutionAxis |  The profile must not cross the axis of revolution.
ProfileNotPlanar |  The Profile must lie in a plane.
Top
See Also
Reference
Autodesk.Revit.DB Namespace